# PreserveCoincidentLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..PreserveCoincidentLines Property
BaseExportOptions Class See Also
---
Whether or not to preserve coincident lines. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public bool PreserveCoincidentLines { get; set; }
```

Visual Basic
---
```text
Public Property PreserveCoincidentLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool PreserveCoincidentLines {
	bool get ();
	void set (bool value);
}
```

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace